import { TranslationType } from './types';

const designServiceLongDescriptionMarkdown = `Проектування кліматичних систем, це комплексний, цікавий та творчий процес, який має врахувати та узгодити велику кількість факторів, вимог та побажань кінцевого споживача. Сам процес проектування має чітку послідовність певних етапів:
- Розробка технічного завдання на проектування;
- Отримання, аналіз та збір вихідних даних;
- Розробка та погодження з замовником концептуальних рішень;
- Проведення розрахунків та підбір обладнання, яке найкраще відповідає вимогам замовника;
- Розробка графічної частини проекту в 3D або 2D моделях;
- Складання детальної специфікації обладнання, матеріалів, компонентів систем та елементів кріплення;
- Складання кошторисної документації в комерційному вигляді або в програмних комплексах АВК-5, Кошторис 8;
- Узгодження та затвердження проекту замовником; Проходження комплексної державної експертизи та отримання позитивного експертного звіту (за необхідності).

Наш досвід охоплює як менші, більш прості проекти, так і великі, нестандартні об'єкти, такі як ядерні станції та виробництво ліків з різними рівнями чистих приміщень. Ми розуміємо специфічні вимоги кожного типу об'єкту і гарантуємо, що наші рішення будуть повністю відповідати вашим потребам.
`;

const supplyServiceLongDescriptionMarkdown = `Послуги з постачання включають забезпечення наших клієнтів високоякісним обладнанням та матеріалами для систем опалення, вентиляції та кондиціонування. Ми співпрацюємо з провідними виробниками, що дозволяє нам гарантувати надійність та ефективність постачаного обладнання. Наші послуги охоплюють:
- Підбір обладнання відповідно до вимог проекту: На основі технічного завдання підбираємо обладнання, яке найкраще відповідає потребам клієнта.
- Закупівля та логістика: Організуємо процес закупівлі та доставку обладнання до об'єкта.
- Контроль якості: Перевіряємо кожну партію обладнання перед відправкою, щоб гарантувати його відповідність вимогам проекту.
- Підтримка та консультації: Надаємо технічну підтримку та консультації щодо вибору та використання обладнання.

Ми маємо досвід постачання обладнання для різних типів об'єктів, від невеликих офісів до великих промислових підприємств, включаючи ядерні станції та фармацевтичні виробництва. Наша команда забезпечує надійну та своєчасну доставку, щоб ваші проекти могли розпочинатися і завершуватися без затримок.
`;

const installationServiceLongDescriptionMarkdown = `Монтаж систем HVAC є ключовим етапом у створенні комфортних умов у будь-якому приміщенні. Наші досвідчені фахівці забезпечують високоякісний монтаж, дотримуючись усіх стандартів та вимог безпеки. Основні етапи монтажних робіт включають:
- Підготовка до монтажу: Аналізуємо проектну документацію та готуємо необхідні матеріали та інструменти.
- Встановлення обладнання: Виконуємо точний монтаж всіх компонентів системи, включаючи вентилятори, кондиціонери, труби та фітинги.
- Підключення та налаштування: Забезпечуємо правильне підключення системи до електричних та водопровідних мереж, а також її налаштування для оптимальної роботи.
- Тестування та введення в експлуатацію: Перевіряємо роботу системи на всіх режимах, усуваємо можливі неполадки та вводимо її в експлуатацію.
- Навчання персоналу: Навчаємо клієнтів та їх персонал правильному використанню та обслуговуванню системи.

Ми маємо досвід монтажу систем HVAC як у невеликих офісах, так і у великих промислових об'єктах, таких як ядерні станції та фармацевтичні виробництва. Наші спеціалісти враховують всі специфічні вимоги кожного типу об'єкту, забезпечуючи безпеку та ефективність встановлених систем.
`;

const maintenanceServiceLongDescriptionMarkdown = `Регулярне технічне обслуговування є запорукою довговічності та ефективної роботи систем HVAC. Наші послуги з технічного обслуговування включають:
- Планове технічне обслуговування: Проводимо регулярні огляди та профілактичні роботи для запобігання можливим поломкам.
- Діагностика та усунення неполадок: Виконуємо детальну діагностику системи для виявлення та усунення будь-яких несправностей.
- Чистка та заміна фільтрів: Забезпечуємо регулярну чистку та заміну фільтрів для підтримки високої якості повітря.
- Оновлення програмного забезпечення: Оновлюємо програмне забезпечення систем автоматизації для підвищення їх ефективності.
- Екстрене обслуговування: Надаємо оперативну допомогу у випадку аварійних ситуацій.

Ми обслуговуємо системи HVAC у різних типах об'єктів, від невеликих офісів до великих промислових підприємств, включаючи ядерні станції та фармацевтичні виробництва. Наша команда спеціалістів завжди готова швидко та якісно вирішити будь-які технічні питання.`;

export const ua: TranslationType = {
  general: {
    contactUs: 'Звʼязатись з нами',
    exploreDetails: 'Детальніше',
    backToMain: 'Повернутись на головну',
    backToList: 'Повернутись до списку',
  },
  header: {
    about: 'Про нас',
    aboutTooltip: '',
    services: 'Послуги',
    servicesTooltip: '',
    projects: 'Проєкти',
    projectsTooltip: '',
    contacts: 'Контакти',
    contactsTooltip: '',
    careers: 'Вакансії',
    carrersTooltip: '',
    news: 'Новини',
    newsTooltip: '',
  },
  welcome: {
    title: 'Досліджуй справжнє мистецтво ідеального клімату з',
    titleNaming: 'Арт-Комфорт',
    subtitle:
      'Абсолютний лідер в сфері кондиціонування та вентиляції вже більше 18-ти років',
    servicesLabel: 'Детальніше про послуги',
  },
  services: {
    title: 'Послуги',
    design: {
      title: 'Проектування',
      description:
        'Відкрийте для себе індивідуальні рішення HVAC за допомогою наших послуг з проектування. Наша команда експертів забезпечить оптимальну продуктивність та комфорт вашого простору, використовуючи передові технології та найкращі галузеві практики. Зв’яжіться з нами, щоб обговорити ваш проєкт сьогодні!',
      longDescription: designServiceLongDescriptionMarkdown,
    },
    supply: {
      title: 'Постачання',
      description:
        "Насолоджуйтесь безперебійним постачанням систем опалення, вентиляції та кондиціонування з нашими послугами з постачання. Ми надаємо високоякісне обладнання та матеріали для забезпечення ефективності та довговічності вашої системи. Зв'яжіться з нами сьогодні, щоб розпочати роботу!",
      longDescription: supplyServiceLongDescriptionMarkdown,
    },
    installation: {
      title: 'Встановлення',
      description:
        'Отримайте професійне встановлення HVAC за допомогою наших послуг з встановлення. Наші досвідчені техніки забезпечать точне та ефективне встановлення, щоб ви могли насолоджуватися надійним комфортом у вашому просторі. Зв’яжіться з нами, щоб запланувати встановлення сьогодні!',
      longDescription: installationServiceLongDescriptionMarkdown,
    },
    maintenance: {
      title: 'Технічне обслуговування',
      description:
        'Забезпечте безперебійну роботу вашої системи HVAC за допомогою наших послуг з технічного обслуговування та підтримки. Наша команда пропонує регулярне технічне обслуговування та надійну підтримку, щоб ваша система працювала ефективно протягом усього року. Зв’яжіться з нами, щоб дізнатися більше про наші плани технічного обслуговування!',
      longDescription: maintenanceServiceLongDescriptionMarkdown,
    },
    exploreServices: 'Дізнайтеся більше про послуги',
  },
  projects: {
    title: 'Проєкти',
    ventilation: {
      title: 'Вентиляція',
      description: 'Свіже повітря цілий рік завдяки нашим експертним рішенням',
      longDescription:
        'Наші проєкти з вентиляції спрямовані на забезпечення свіжого та чистого повітря у вашому просторі протягом усього року. Ми розробляємо та впроваджуємо високоефективні вентиляційні системи, які відповідають найвищим стандартам якості та ефективності. Наші рішення допомагають знизити рівень забруднення повітря, видаляючи пил, алергени та інші шкідливі частинки. Завдяки нашим сучасним технологіям та професійному підходу, ми створюємо здорове та комфортне середовище для вас і вашої родини чи колективу. Зв’яжіться з нами сьогодні, щоб обговорити ваш проєкт вентиляції.',
    },
    airConditioning: {
      title: 'Кондиціонування',
      description: 'Прохолода цілий рік завдяки нашим експертним рішенням',
      longDescription:
        'Наші проєкти з кондиціонування спрямовані на забезпечення оптимальної прохолоди у вашому просторі протягом усього року. Ми пропонуємо індивідуальні рішення для різних типів будівель, враховуючи всі аспекти, від площі до кліматичних умов. Наші системи кондиціонування забезпечують ефективне охолодження, мінімізуючи енергоспоживання та витрати. Завдяки нашим професійним установникам та високоякісному обладнанню, ви отримаєте надійну та довговічну систему кондиціонування, яка підтримуватиме комфортну температуру навіть у найспекотніші дні. Зв’яжіться з нами сьогодні, щоб обговорити ваш проєкт кондиціонування.',
    },
    heating: {
      title: 'Опалення',
      description: 'Тепло та комфорт завдяки нашим експертним рішенням',
      longDescription:
        'Наші проєкти з опалення спрямовані на забезпечення затишку та тепла у вашому просторі протягом усього року. Ми пропонуємо інноваційні рішення для опалення, які забезпечують рівномірне та ефективне розподілення тепла у всіх приміщеннях. Наші системи опалення допомагають знизити енергетичні витрати та підвищити ефективність використання енергії, що робить ваш будинок або офіс більш екологічно чистим. З нашими досвідченими техніками та якісним обладнанням ви зможете насолоджуватися теплом та комфортом навіть у найхолодніші дні. Зв’яжіться з нами сьогодні, щоб обговорити ваш проєкт опалення.',
    },
    airPurifying: {
      title: 'Фільтрація повітря',
      description: 'Дихайте легше завдяки нашим сучасним системам',
      longDescription:
        'Наші проєкти з очищення повітря спрямовані на створення здорового та чистого середовища у вашому просторі. Ми використовуємо передові технології для видалення забруднюючих речовин, алергенів та мікроорганізмів з повітря, що допомагає покращити якість повітря та зменшити ризик респіраторних захворювань. Наші системи очищення повітря ефективні та енергоощадні, забезпечуючи вам максимальний комфорт та безпеку. Завдяки нашому професійному підходу та високоякісному обладнанню, ви зможете насолоджуватися свіжим та чистим повітрям у вашому домі чи офісі. Зв’яжіться з нами сьогодні, щоб обговорити ваш проєкт очищення повітря.',
    },
    waterTreatment: {
      title: 'Сушіння повітря',
      description: 'Чиста та безпечна вода завдяки нашим ефективним рішенням',
      longDescription:
        'Наші проєкти з очищення води спрямовані на забезпечення вас чистою та безпечною водою для всіх ваших потреб. Ми пропонуємо індивідуальні рішення для очищення води, які включають видалення забруднюючих речовин, хімічних домішок та мікроорганізмів. Наші системи очищення води забезпечують високу якість та безпеку води, що підходить для пиття, приготування їжі та інших побутових потреб. Завдяки нашому досвіду та передовим технологіям, ми можемо забезпечити надійне та ефективне очищення води, яке відповідає вашим потребам. Зв’яжіться з нами сьогодні, щоб обговорити ваш проєкт очищення води.',
    },
    airHumidifying: {
      title: 'Зволоження повітря',
      description: 'Ідеальний рівень вологості для максимального комфорту',
      longDescription:
        'Наші проєкти з зволоження повітря спрямовані на забезпечення оптимального рівня вологості у вашому просторі, що допомагає покращити якість повітря та створити комфортні умови для життя та роботи. Ми використовуємо передові системи зволоження, які рівномірно розподіляють вологу по всіх приміщеннях, запобігаючи пересушуванню повітря та поліпшуючи загальний мікроклімат. Наші рішення підходять для різних типів будівель та забезпечують енергоефективне використання ресурсів. Завдяки нашому професійному підходу та високоякісному обладнанню, ви зможете насолоджуватися комфортом та здоровим середовищем у вашому домі чи офісі. Зв’яжіться з нами сьогодні, щоб обговорити ваш проєкт зволоження повітря.',
    },
    showAllProjects: 'Переглянути всі проєкти',
  },
  statistics: {
    experience: 'Років досвіду',
    projects: 'Успішно завершених проєктів',
    clients: 'Постійних клієнтів',
  },
  team: {
    title: 'Наша команда',
  },
  news: {
    title: 'Новини',
    showAll: 'Переглянути всі новини',
  },
  contacts: {
    title: 'Контакти',
    contactUsDirectly: 'Зв’яжіться з нами безпосередньо',
    leaveRequest: 'Залишити запит',
    locationLabel: 'вул. Берковецька 6а, м. Київ',
  },
  form: {
    name: {
      label: 'Ім’я',
      error: "Будь ласка, введіть ваше ім'я",
    },
    email: {
      label: 'Ел. пошта',
      error: 'Будь ласка, введіть ваш email',
      invalidError: 'Йой, здається десь є помилка',
    },
    phone: {
      label: 'Номер телефону (+380)',
      error: 'Будь ласка, введіть ваш телефон',
    },
    message: {
      label: 'Повідомлення',
    },
    motivationMessage: {
      label: 'Чому ви хочете працювати в Art-Comfort?',
      error: 'Будь ласка, розкажіть, чому ви хочете працювати з нами',
    },
    files: {
      label: 'Прикріпити файли',
    },
    send: 'Відправити',
  },
  vacancies: {
    openPositions: 'Відкриті позиції',
    searchVacanciesPlaceholder: 'Пошук вакансії',
    vacancyNamePlaceholder: 'Назва вакансії',
    vacancyLocationPlaceholder: 'Локація',
  },
  about: {
    showMoreLabel: 'Показати більше',
    hideLabel: 'Сховати',
  },
};
