export type Vacancy = {
  id: string;
  jobTitle: string;
  location: string;
  shortDescription: string;
  longDescription: string[];
};

type VacancyColumn = {
  key: keyof Omit<Vacancy, 'longDescription'>;
  header: string;
};

export const vacanciesColumns: VacancyColumn[] = [
  { key: 'jobTitle', header: 'Назва Вакансії' },
  { key: 'location', header: 'Локація' },
  { key: 'shortDescription', header: 'Короткий опис' },
];

export const vacancies: Vacancy[] = [
  {
    id: '1a2b3c4d5e',
    jobTitle: 'Інженер-Проєктувальник систем ОВіК',
    location: 'Київ, Україна',
    shortDescription:
      'Проектування систем вентиляції, кондиціонування, зволоження, осушення повітря, опалення',
    longDescription: [
      'Компанія **ТОВ «АРТ-КОМФОРТ»** є провідним постачальником послуг у сфері інжинірингу.',
      'Ми спеціалізуємося на наданні послуг з проектування, монтажу та обслуговування систем вентиляції та кондиціонування повітря для різних типів будівель, включаючи офісні приміщення, торгові центри, готелі, ресторани та промислові комплекси.',
      'У зв’язку із розширенням діяльності підприємства запрошуємо в нашу дружню команду **Інженера-проектувальника систем ОВіК.**',
      '**Основні функціональні обов’язки:**',
      '- проектування систем вентиляції, кондиціонування, зволоження, осушення повітря, опалення;',
      '- комплексний підхід до підготовки інженерно-технічних рішень та проектів систем опалення, вентиляції та кондиціонування повітря для об’єктів різного рівня складності;',
      '- підготовка виконавчої документації;',
      '- проведення всіх необхідних розрахунків (повітрообмін, теплотехнічний розрахунок, розрахунок систем кондиціонування);',
      '- погодження проектних рішень із замовником;',
      '- авторський нагляд.  ',
      '**Для нас важливо:**',
      '- вища освіта в галузі інженерії (електротехніка, теплотехніка, вентиляція та кондиціонування повітря);',
      '- досвід роботи на аналогічній посаді у сфері кондиціонування, вентиляції, опалення від 3 (трьох) років;',
      '- впевнене володіння програмними продуктами для проектування систем ОВіК (AutoCAD, MagiCAD, Revit і т.д.);',
      '- глибокі знання технічних стандартів та правил в галузі систем ОВіК;',
      '- знання нормативної документації (ДБН, ДСТУ);',
      '- наявність кваліфікаційного сертифікату інженера-проектувальника (СС2, СС3) – буде перевагою;',
      '- активна життєва позиція, відповідальність та порядність, готовність працювати в команді;',
      '- бажання навчатись та підвищувати свій професійний рівень в команді однодумців.',
      '- участь у цікавих проектах різного рівня складності;',
      '- офіційне працевлаштування та гідний рівень фінансової мотивації, КPI;',
      '- навчання та розвиток у команді однодумців;',
      '- Можливість професійного зростання в команді.',
    ],
  },
  {
    id: '1a2b3c4d5eaue',
    jobTitle: 'Монтажник систем вентиляції та кондиціонування повітря',
    location: 'Київ, Україна',
    shortDescription:
      'Виконання робіт з монтажу систем вентиляції та кондиціонування повітря',
    longDescription: [
      '**Монтажник систем вентиляції та кондиціонування повітря**',
      'Компанія **ТОВ «АРТ-КОМФОРТ»** є провідним постачальником послуг у сфері сучасного інжинірингу. Ми спеціалізуємося на наданні послуг з проектування, монтажу та обслуговування систем вентиляції та кондиціонування повітря для різних типів будівель, включаючи офісні приміщення, торгові центри, готелі, ресторани та промислові комплекси.',
      'У зв’язку із розширенням діяльності підприємства запрошуємо в нашу дружню команду **Монтажників систем вентиляції та кондиціонування повітря.**',
      '**Для нас важливо:**',
      '- досвід роботи з монтажу та сервісного обслуговування кліматичного обладнання;',
      '- напрацьовані навички роботи з системами кондиціонування та вентиляції різного рівня складності;',
      '- клієнтоорієнтованість, гнучкість, професіоналізм та відповідальність;',
      '- відсутність шкідливих звичок;',
      '- орієнтованість на позитивний результат.',
      '**Обов’язки:**',
      '- виконання робіт з монтажу систем вентиляції та кондиціонування повітря;',
      '- проведення сервісного та технічного обслуговування систем вентиляції та кондиціонування повітря різного рівня складності.',
      '**Ми пропонуємо найкращому кандидату:**',
      '- гідну заробітну плату (ставка + %), виплата регулярно 2 рази на місяць;',
      '- офіційне працевлаштування;',
      '- робота в дружньому колективі, корпоративні заходи;',
      '- можливість навчання та підвищення кваліфікації в команді професіоналів.',
    ],
  },
];
