import { LocaleKeysSkeleton } from '@/locales/types';

export const ua: LocaleKeysSkeleton = {
  general: {
    contactUs: 'Звʼязатись з нами',
    exploreDetails: 'Дізнатись детальніше',
  },
  header: {
    about: 'Про нас',
    aboutTooltip: '',
    services: 'Послуги',
    servicesTooltip: '',
    projects: 'Проєкти',
    projectsTooltip: '',
    contacts: 'Контакти',
    contactsTooltip: '',
    careers: 'Вакансії',
    carrersTooltip: '',
    news: 'Новини',
    newsTooltip: '',
  },
  welcome: {
    title: 'Досліджуй справжнє мистецтво ідеального клімату з',
    titleNaming: 'Арт-Комфорт',
    subtitle:
      'Абсолютний лідер в сфері кондиціонування та вентиляції вже більше 18-ти років',
    servicesLabel: 'Детальніше про послуги',
  },
  services: {
    title: 'Послуги',
    design: {
      title: 'Проектування',
      description:
        'Відкрийте для себе індивідуальні рішення HVAC за допомогою наших послуг з проектування. Наша команда експертів забезпечить оптимальну продуктивність та комфорт вашого простору, використовуючи передові технології та найкращі галузеві практики. Зв’яжіться з нами, щоб обговорити ваш проєкт сьогодні!',
      longDescription:
        'Наша послуга з Проектування присвячена створенню індивідуальних систем HVAC, адаптованих до унікальних потреб вашого простору. Ми розуміємо, що кожна будівля є різною, саме тому наша експертна команда проводить комплексну оцінку для визначення ваших вимог. Від житлових будинків до великих комерційних комплексів, ми враховуємо всі змінні, такі як площа, заповнюваність та моделі використання, щоб створити рішення, яке забезпечить оптимальну ефективність та комфорт. Наше найсучасніше програмне забезпечення для проектування дозволяє нам надавати детальні креслення та 3D моделі, забезпечуючи вам чітке розуміння запропонованої системи перед її впровадженням. Зосереджуючись на енергоефективності та сталості, наші проекти не лише покращують якість повітря в приміщенні, але й допомагають знизити довгострокові енергетичні витрати.',
    },
    supply: {
      title: 'Постачання',
      description:
        'Насолоджуйтесь безперебійним постачанням систем HVAC з нашими послугами постачання. Ми надаємо високоякісне обладнання та матеріали, щоб забезпечити ефективність та довговічність вашої системи. Зв’яжіться з нами сьогодні, щоб розпочати!',
      longDescription:
        'Наша послуга Постачання забезпечує вас високоякісним обладнанням HVAC від провідних виробників. Ми встановили партнерські стосунки з авторитетними брендами, гарантуючи, що ви матимете доступ до найновіших та найнадійніших продуктів на ринку. Незалежно від того, чи потрібні вам печі, кондиціонери, теплові насоси чи вентиляційні системи, ми пропонуємо широкий вибір варіантів, що відповідають різним вподобанням та бюджетам. Наша команда добре обізнана з технічними характеристиками кожного продукту, що дозволяє нам рекомендувати найкращі рішення для ваших конкретних потреб. Завдяки швидкій доставці та конкурентним цінам, ми робимо процес придбання обладнання HVAC безперебійним та ефективним, забезпечуючи дотримання графіка вашого проєкту.',
    },
    installation: {
      title: 'Встановлення',
      description:
        'Отримайте професійне встановлення HVAC за допомогою наших послуг з встановлення. Наші досвідчені техніки забезпечать точне та ефективне встановлення, щоб ви могли насолоджуватися надійним комфортом у вашому просторі. Зв’яжіться з нами, щоб запланувати встановлення сьогодні!',
      longDescription:
        'Наша послуга Встановлення призначена для надання вам професійного та ефективного встановлення ваших систем HVAC. Наші сертифіковані техніки мають великий досвід та підготовку, забезпечуючи, що кожне встановлення виконується на найвищому рівні. Ми дотримуємося ретельного процесу, від підготовки місця та розміщення обладнання до тестування системи та введення в експлуатацію. Наша команда гарантує, що всі компоненти встановлені правильно та що система працює на повну потужність з першого дня. Ми дотримуємося всіх норм безпеки та будівельних норм, забезпечуючи вам спокій, що ваша система HVAC встановлена безпечно та ефективно. Незалежно від того, чи це нове встановлення, чи модернізація існуючої системи, ми гарантуємо безпроблемний досвід та чудові результати.',
    },
    maintenance: {
      title: 'Технічне обслуговування',
      description:
        'Забезпечте безперебійну роботу вашої системи HVAC за допомогою наших послуг з технічного обслуговування та підтримки. Наша команда пропонує регулярне технічне обслуговування та надійну підтримку, щоб ваша система працювала ефективно протягом усього року. Зв’яжіться з нами, щоб дізнатися більше про наші плани технічного обслуговування!',
      longDescription:
        'Наша послуга Технічного обслуговування призначена для забезпечення безперебійної та ефективної роботи ваших систем HVAC протягом року. Регулярне технічне обслуговування є ключовим для запобігання несподіваним поломкам та продовження терміну служби вашого обладнання. Наші пакети технічного обслуговування включають ретельні інспекції, чистку та налаштування всіх компонентів HVAC. Ми перевіряємо наявність будь-яких ознак зносу, замінюємо фільтри та гарантуємо, що всі частини працюють правильно. Наш проактивний підхід допомагає виявити потенційні проблеми до того, як вони стануть серйозними проблемами, заощаджуючи ваш час та гроші в довгостроковій перспективі. З гнучким графіком та оперативним обслуговуванням, наші плани технічного обслуговування адаптовані до ваших потреб, забезпечуючи безперервний комфорт та спокій.',
    },
    exploreServices: 'Дізнайтеся більше про послуги',
  },
  projects: {
    title: 'Проєкти',
    ventilation: {
      title: 'Вентиляція',
      description: 'Свіже повітря цілий рік з нашими експертними рішеннями.',
    },
    airConditioning: {
      title: 'Кондиціонування повітря',
      description: 'Прохолодність цілий рік з нашими експертними рішеннями.',
    },
    heating: {
      title: 'Опалення',
      description: 'Тепло та комфорт з нашими експертними рішеннями.',
    },
    airPurifying: {
      title: 'Очищення повітря',
      description: 'Легше дихання з нашими вдосконаленими системами.',
    },
    waterTreatment: {
      title: 'Очищення води',
      description: 'Чиста та безпечна вода з нашими ефективними рішеннями.',
    },
    airHumidifying: {
      title: 'Зволоження повітря',
      description: 'Ідеальний рівень вологості для максимального комфорту.',
    },
    showAllProjects: 'Переглянути всі проєкти',
  },
  statistics: {
    experience: 'Років досвіду',
    projects: 'Успішно завершених проєктів',
    clients: 'Постійних клієнтів',
  },
  team: {
    title: 'Наша команда',
  },
  news: {
    title: 'Новини',
    showAll: 'Переглянути всі новини',
  },
  contacts: {
    title: 'Контакти',
    contactUsDirectly: 'Звʼязатись напряму',
    leaveRequest: 'Лишити заявку',
    form: {
      name: {
        label: 'Імʼя',
        error: '',
      },
      email: {
        label: 'Електронна пошта',
        error: '',
      },
      phone: {
        label: 'Номер телефону (+380)',
        error: '',
      },
      message: {
        label: 'Повідомлення',
      },
      files: {
        label: 'Прикріпити файли',
      },
      send: 'Надіслати',
    },
  },
};
