import { LocaleKeysSkeleton } from '@/locales/types';

export const ua: LocaleKeysSkeleton = {
  general: {
    contactUs: 'Звʼязатись з нами',
    exploreDetails: 'Дізнатись детальніше',
  },
  header: {
    about: 'Про нас',
    aboutTooltip: '',
    services: 'Послуги',
    servicesTooltip: '',
    projects: 'Проєкти',
    projectsTooltip: '',
    contacts: 'Конткти',
    contactsTooltip: '',
    careers: 'Вакансії',
    carrersTooltip: '',
    news: 'Новини',
    newsTooltip: '',
  },
  welcome: {
    title: 'Досліджуй справжнє мистецтво ідеального клімату з Арт-Комфорт',
    subtitle:
      'Абсолютний лідер в сфері кондиціонування та вентиляції вже більше 18-ти років',
    servicesLabel: 'Детальніше про послуги',
  },
  services: {
    title: 'Послуги',
    design: {
      title: 'Проєктування',
      description:
        "Відкрийте для себе індивідуальні рішення HVAC за допомогою наших послуг з проектування. Наша команда експертів забезпечить оптимальну продуктивність і комфорт для вашого приміщення, використовуючи передові технології та найкращі галузеві практики. Зв'яжіться з нами, щоб обговорити ваш проект вже сьогодні!",
    },
    supply: {
      title: 'Постачання',
      description:
        "Насолоджуйтесь безперебійним постачанням систем опалення, вентиляції та кондиціонування з нашими послугами з постачання. Ми надаємо високоякісне обладнання та матеріали для забезпечення ефективності та довговічності вашої системи. Зв'яжіться з нами сьогодні, щоб розпочати роботу!",
    },
    installation: {
      title: 'Монтаж',
      description:
        "Отримайте професійний монтаж систем опалення, вентиляції та кондиціонування за допомогою наших монтажних послуг. Наші досвідчені фахівці забезпечать точний та ефективний монтаж, щоб ви могли насолоджуватися надійним комфортом у вашому приміщенні. Зв'яжіться з нами, щоб запланувати встановлення вже сьогодні!",
    },
    maintenance: {
      title: 'Сервіс',
      description:
        "Забезпечте безперебійну роботу вашої системи опалення, вентиляції та кондиціонування за допомогою наших послуг з технічного обслуговування та підтримки. Наша команда пропонує регулярне технічне обслуговування та надійну підтримку, щоб забезпечити ефективну роботу вашої системи цілий рік. Зв'яжіться з нами, щоб дізнатися більше про наші плани технічного обслуговування!",
    },
    exploreServices: 'Детальніше про послуги',
  },
  projects: {
    title: '',
    ventilation: {
      title: 'Вентиляція',
      description: 'Свіже повітря цілий рік з нашими експертними рішеннями.',
    },
    airConditioning: {
      title: 'Кондиціонування повітря',
      description: 'Прохолодність цілий рік з нашими експертними рішеннями.',
    },
    heating: {
      title: 'Опалення',
      description: 'Тепло та комфорт з нашими експертними рішеннями.',
    },
    airPurifying: {
      title: 'Очищення повітря',
      description: 'Легше дихання з нашими вдосконаленими системами.',
    },
    waterTreatment: {
      title: 'Очищення води',
      description: 'Чиста та безпечна вода з нашими ефективними рішеннями.',
    },
    airHumidifying: {
      title: 'Зволоження повітря',
      description: 'Ідеальний рівень вологості для максимального комфорту.',
    },
    showAllProjects: 'Переглянути всі проєкти',
  },
  statistics: {
    experience: 'Років досвіду',
    projects: 'Успішно завершених проєктів',
    clients: 'Постійних клієнтів',
  },
  team: {
    title: 'Наша команда',
  },
  news: {
    title: 'Новини',
    showAll: 'Переглянути всі новини',
  },
  contacts: {
    title: 'Контакти',
    contactUsDirectly: 'Звʼязатись напряму',
    leaveRequest: 'Лишити заявку',
    form: {
      name: {
        label: 'Імʼя',
        error: '',
      },
      email: {
        label: 'Електронна пошта',
        error: '',
      },
      phone: {
        label: 'Номер телефону (+380)',
        error: '',
      },
      message: {
        label: 'Повідомлення',
      },
      files: {
        label: 'Прикріпити файли',
      },
      send: 'Надіслати',
    },
  },
};
