import { motion } from 'framer-motion';
import { useRouter } from 'next/router';
import { useCallback } from 'react';

import { Layout } from '@/components/layout';
import { SectionWrapper } from '@/components/sectionWrapper';

import { Button } from '@/ui/Button';
import { cn } from '@/utils';
import { services } from '@/utils/dataset/services.dataset';
import { useTranslations } from '@/utils/locales';

const ServicePage = () => {
  const router = useRouter();
  const { services: servicesTranslations, general } = useTranslations();
  const service = services(servicesTranslations).find(
    (service) => service.id === router.query.slug
  );
  const renderDesign = useCallback(() => {
    return (
      <div className=''>
        <p className='mt-4'>
          Проектування – це фундамент, на якому будується успіх будь-якого
          інженерного проекту. У компанії <strong>АРТ-КОМФОРТ</strong> ми
          перетворюємо складні технічні завдання на досконалі інженерні рішення,
          адаптовані до потреб клієнтів і сучасних стандартів.
        </p>
        <div className='mt-4'>
          <p className=''>Ми проектуємо системи:</p>
          <ul className='ml-8 flex list-disc flex-col gap-2 text-sm'>
            <li className='mt-2'>
              <strong>ОВІК</strong> (опалення, вентиляція, кондиціонування
              повітря) для складних приміщень, включаючи чисті приміщення
              фармацевтичних виробництв.
            </li>
            <li className=''>
              <strong>Автоматизації будівель (BMS)</strong>: інтеграція
              клімат-контролю, енергоспоживання та безпеки в єдину систему
              управління.
            </li>
            <li>
              <strong>Систем безпеки </strong>: проекти відеоспостереження,
              контролю доступу, систем сигналізації.
            </li>
            <li>
              <strong>Водопостачання та водовідведення</strong>: ефективні
              рішення для постачання та очищення води.
            </li>
            <li>
              <strong>Електротехнічних систем</strong>: проектування освітлення,
              енергопостачання та автоматизації процесів.
            </li>
          </ul>
        </div>
        <div className='mt-4'>
          <p>Наші ключові переваги:</p>
          <ol className='ml-8 flex list-decimal flex-col gap-2 text-sm'>
            {/* Experience and reliability */}
            <li className='mt-2'>
              <strong>Досвід і надійність</strong>
              <p className='mt-2'>
                Ми маємо багаторічний досвід у реалізації проектів для таких
                замовників, як:
              </p>
              <ul className='ml-8 flex list-disc flex-col gap-2 text-sm'>
                <li className='mt-2'>
                  <i className='font-semibold'>ПАО «ФАРМАК»</i> – проекти для
                  чистих приміщень фармацевтичного виробництва.
                </li>
                <li>
                  <i className='font-semibold'>
                    Державна служба лікарських засобів
                  </i>{' '}
                  – проектування лабораторних систем.
                </li>
                <li>
                  <i className='font-semibold'> ПАО «Укртелеком»</i> – масштабні
                  системи ОВІК для адміністративних будівель.
                </li>
                <li>
                  <i className='font-semibold'>
                    Іноземне підприємство «1+1 ПРОДАКШН»
                  </i>{' '}
                  – інноваційні рішення для студійних комплексів.
                </li>
                <li>
                  <i className='font-semibold'>
                    Київська міська Державна адміністрація
                  </i>{' '}
                  – автоматизація адміністративних об’єктів.
                </li>
              </ul>
            </li>
            {/* Innovational instruments */}
            <li className=''>
              <strong>Інноваційні інструменти</strong>
              <p className='mt-2'>
                Наші проектанти працюють із використанням сучасних програм:
              </p>
              <ul className='ml-8 flex list-disc flex-col gap-2 text-sm'>
                <li className='mt-2'>
                  <i className='font-semibold'>Revit</i> – для створення
                  3D-моделей і точних інженерних рішень.
                </li>
                <li className='font-semibold'>
                  <i>AutoCAD</i> – для деталізованих креслень та документації.
                </li>
                <li className='font-semibold'>
                  <i>Magicad</i> – для моделювання інженерних мереж у
                  BIM-середовищі.
                </li>
              </ul>
              <p className='mt-2'>
                Це дозволяє нам досягати максимальної точності та враховувати
                всі нюанси проекту.
              </p>
            </li>
            {/* Енергоефективність та комфорт */}
            <li className=''>
              <strong> Енергоефективність та комфорт</strong>
              <p className='mt-2'>
                Наші рішення забезпечують оптимальний мікроклімат у приміщеннях
                та мінімізують витрати на експлуатацію. Ми інтегруємо системи
                рекуперації тепла, які значно знижують енерговитрати навіть у
                найскладніших умовах.
              </p>
            </li>
            {/* Індивідуальний підхід */}
            <li className=''>
              <strong>Індивідуальний підхід</strong>
              <p className='mt-2'>
                Ми адаптуємо кожен проект до особливостей об’єкта, враховуючи
                його призначення, функціональність і бюджет.
              </p>
              <hr className='my-2 w-10/12' />
              <p>Як ми працюємо?</p>
              <ol className='ml-8 flex list-decimal flex-col gap-2 text-sm'>
                <li className='mt-2'>
                  <i className='font-semibold'>Аналіз об’єкта: </i> оцінюємо
                  технічні особливості та потреби замовника.
                </li>
                <li>
                  <i className='font-semibold'>Концепція: </i> розробляємо
                  оптимальні інженерні рішення.
                </li>
                <li>
                  <i className='font-semibold'>Проектування: </i> створюємо
                  креслення та моделі, які відповідають стандартам.
                </li>
                <li>
                  <i className='font-semibold'>Підтримка: </i>забезпечуємо
                  консультації та супровід на всіх етапах реалізації проекту.
                </li>
                <li>
                  <i className='font-semibold'>
                    Київська міська Державна адміністрація
                  </i>{' '}
                  – автоматизація адміністративних об’єктів.
                </li>
              </ol>
            </li>
          </ol>
        </div>
      </div>
    );
  }, []);
  const renderSupply = useCallback(() => {
    return (
      <div className=''>
        <p className='mt-4'>
          На кожному великому будівельному проекті є той момент, коли все
          залежить від обладнання: його якості, надійності та відповідності
          задачам. Це як вибрати двигун для гоночного авто – будь-яка помилка
          може зупинити рух. У компанії <strong>АРТ-КОМФОРТ</strong> ми знаємо
          ціну кожної деталі. Тому наше постачання обладнання – це не просто
          купівля-продаж, це високоточна інженерна робота, підтримана досвідом і
          технологіями.
        </p>
        <p className='mt-2'>
          Ми працюємо тільки з провідними брендами, такими як{' '}
          <strong>
            Mitsubishi Electric, Daikin, Systemair, Carel, Zanotti,
          </strong>{' '}
          і відвідуємо їхні заводи, щоб розуміти всі можливості та інновації. Ви
          знали, що, наприклад, чилери <strong>Daikin</strong> використовують
          новітні екологічні технології для зниження енерговитрат? Ми це знаємо,
          бо бачили ці системи в дії.
        </p>
        <p className='mt-2'>
          А тепер уявіть міжнародну виставку <strong>ISH</strong>: інженери з
          усього світу, сучасні стенди з інноваційним обладнанням, нові моделі,
          які ще не потрапили на ринок. Ми там завжди, бо тільки так можна
          гарантувати, що ваш проект отримає найкраще.
        </p>
        <hr className='my-4' />
        <p>Що ми постачаємо?</p>
        <ol className='ml-4 mt-2 flex list-decimal flex-col gap-2 text-sm'>
          <li className=''>
            <p>Кондиціонери для будь-яких задач:</p>
            <p className='mt-2'>
              Від стандартних систем для офісів до прецизійних рішень для
              серверних приміщень. У нашому асортименті – бренди, яким довіряє
              весь світ:
            </p>
            <ul className='ml-4 mt-2 list-disc'>
              <li>
                <strong>Mitsubishi Electric, Daikin, Lessar, Sakata</strong> –
                ідеальний комфорт у будь-якому приміщенні.
              </li>
              <li>
                Прецизійні кондиціонери{' '}
                <strong>Emerson Network Power, Emicon</strong> – для там, де
                клімат має бути під повним контролем.
              </li>
            </ul>
            <p className='mt-2'>
              Вентиляція – свіже дихання для вашого об’єкта:
            </p>
            <p className='mt-2'>
              Ми постачаємо вентиляційні системи{' '}
              <strong>Daikin, Systemair, РЕМАК,</strong> які не просто оновлюють
              повітря, а роблять його здоровим та енергоефективним.
            </p>
          </li>
          <li>
            <p>Промисловий холод:</p>
            <p className='mt-2'>
              Системи для зберігання продуктів харчування, виробництва чи
              спеціалізованих приміщень:
            </p>
            <ul className='ml-4 list-disc'>
              <li className='mt-2'>
                Моноблоки та спліт-системи <strong>Zanotti</strong> – для винних
                погребів та ковбасних виробництв.
              </li>
              <li>
                Чилери та фанкойли{' '}
                <strong>Daikin, Systemair, Liebert, Emicon</strong> – для
                масштабних проектів.
              </li>
            </ul>
          </li>
          <li>
            <p>Зволоження та осушення повітря:</p>
            <ul className='ml-4 list-disc'>
              <li className='mt-2'>
                Зволожувачі <strong>Carel</strong> – найкращі рішення для
                точного клімат-контролю.
              </li>
              <li>
                Осушувачі <strong>Dantherm, HB COTES</strong> – підтримують
                баланс вологості навіть у складних умовах.
              </li>
            </ul>
          </li>
        </ol>
        <hr className='my-4' />
        <p>Як ми це робимо?</p>
        <ol className='ml-4 mt-2 list-decimal text-sm'>
          <li>
            <p>Глибоке розуміння обладнання</p>
            <p className='ml-4'>
              Кожен кондиціонер, чилер чи зволожувач ми знаємо не з рекламних
              буклетів, а з реальних заводів. Відвідування виробників,
              тестування обладнання, знайомство з інженерами – це частина нашої
              роботи.
            </p>
          </li>
          <li>
            <p>Співпраця з найкращими брендами</p>
            <p className='ml-4'>
              Ми працюємо тільки з перевіреними постачальниками, такими як
              Mitsubishi Electric, Daikin, Systemair, щоб ви отримували
              обладнання, яке прослужить роки.
            </p>
          </li>
          <li>
            <p>Індивідуальний підхід до вашого проект</p>
            <p className='ml-4'>
              Ми не просто продаємо обладнання – ми допомагаємо обрати саме те,
              що ідеально підійде для ваших умов. Потрібна вентиляція для
              ресторану чи система кондиціонування для фармацевтичної
              лабораторії? Ми знайдемо рішення.
            </p>
          </li>
        </ol>
        <hr className='my-4' />
        <p>Наші референції:</p>
        <p className='mt-2'>
          Ми вже постачали обладнання для таких об’єктів, як:
        </p>
        <ul className='ml-4 flex list-disc flex-col text-sm'>
          <li>
            <strong>ПАО «ФАРМАК»</strong> – фармацевтичні комплекси з
            унікальними умовами.
          </li>
          <li>
            <strong>ГП «Укрспецекспорт»</strong> – системи для стратегічних
            державних підприємств.
          </li>
          <li>
            <strong>Київська міська державна адміністрація</strong> – масштабні
            проекти вентиляції та автоматизації.
          </li>
          <li>
            <strong>Ресторан «Полісся»</strong> – інноваційні рішення для
            комфортного відпочинку.
          </li>
        </ul>
        <hr className='my-4' />
        <p>Чому обирають нас?</p>
        <p className='mt-2'>
          Бо ми не просто доставляємо обладнання. Ми доставляємо якість,
          інновації та впевненість у тому, що ваша система буде працювати як
          швейцарський годинник. З нами ваш проект отримає все найкраще – від
          зволожувача до складної системи автоматизації.
        </p>

        <p className='mt-2'>
          <strong>АРТ-КОМФОРТ</strong> – ваш партнер у світі найсучаснішого
          обладнання. Готові почати?
        </p>
      </div>
    );
  }, []);
  const renderInstallation = useCallback(() => {
    return (
      <div className=''>
        <p className='mt-2'>
          Монтаж систем – це той момент, коли проект із креслень і моделей
          починає перетворюватися на реальність. Але зробити монтаж правильно –
          це як виконати ювелірну роботу: кожен елемент має бути на своєму
          місці, інакше весь механізм не запрацює. У компанії{' '}
          <strong>АРТ-КОМФОРТ</strong> ми знаємо, що навіть найменша деталь має
          значення
        </p>
        <p className='mt-2'>
          Наші монтажники – це справжні майстри своєї справи. Вони не просто
          встановлюють обладнання, а роблять це з точністю, яка забезпечує
          довговічність і ефективність системи. Ми працюємо із системами
          будь-якої складності:
        </p>
        <ul className='ml-4 list-disc'>
          <li>
            Від стандартних систем вентиляції для офісів до повноцінних систем
            ОВІК для промислових об’єктів.
          </li>
          <li>
            Від базового встановлення кондиціонерів до монтажу складних систем
            автоматизації будівель (BMS).
          </li>
          <li>
            Від монтажу теплових насосів до складних проектів із рекуперацією
            тепла.
          </li>
        </ul>
        <hr className='my-4' />
        <p>Наша експертиза:</p>
        <ol className='ml-4 list-decimal'>
          <li>
            <p>Сертифікати та ліцензії</p>
            <p className='mt-2'>
              Ми не лише обіцяємо якість, а й гарантуємо її відповідними
              документами. У нас є всі необхідні сертифікати, включаючи:
            </p>
            <ul className='ml-4 list-disc text-sm'>
              <li className='font-bold'>
                Ліцензії на проведення монтажних робіт.
              </li>
              <li>
                <strong>
                  Дозвіл на виконання небезпечних робіт від ДержГірПромНагляд.
                </strong>{' '}
                Це означає, що навіть найскладніші й найризикованіші завдання –
                в надійних руках.
              </li>
            </ul>
          </li>
          <li>
            <p>Монтаж будь-якої складності</p>
            <p>Ми впораємося з будь-яким завданням:</p>
            <ul className='ml-4 list-disc text-sm'>
              <li>
                Простий монтаж кондиціонерів або систем вентиляції для невеликих
                офісів чи ресторанів.
              </li>
              <li>
                Встановлення складних систем автоматизації для великих
                адміністративних будівель, таких як Київська міська державна
                адміністрація.
              </li>{' '}
              <li>
                Складні рішення для фармацевтичних об’єктів, наприклад, ПАО
                «ФАРМАК».
              </li>
            </ul>
          </li>
          <li>
            Пуско-налагоджувальні роботи
            <p className='mt-2'>
              Ми не просто монтуємо обладнання, а й проводимо його запуск,
              налаштовуємо всі системи та перевіряємо їхню ефективність. Це
              гарантує бездоганну роботу з першого дня.
            </p>
          </li>
        </ol>
        <hr className='my-4' />
        <p>Як ми працюємо?</p>
        <ul className='ml-4 list-disc text-sm'>
          <li>Аналіз об’єкта</li>
          <li>
            Перед початком роботи ми вивчаємо всі особливості об’єкта, щоб
            уникнути непередбачуваних ситуацій.
          </li>
          <li>Монтаж</li>
          <li>
            Використовуємо сучасні технології та обладнання для виконання робіт
            на найвищому рівні.
          </li>
          <li>Тестування та налаштування</li>
          <li>Перевіряємо, щоб кожен елемент</li>
          системи працював так, як потрібно.
          <li>Передача в експлуатацію</li>
          <li>
            Наші фахівці надають повну консультацію з експлуатації системи та
            забезпечують підтримку після монтажу.
          </li>
        </ul>
        <hr className='my-4' />
        <p>Наші референції:</p>
        <p className='mt-2'>
          Ми вже виконували монтажні роботи для таких об’єктів, як:
        </p>
        <ul className='ml-4 list-disc text-sm'>
          <li>
            <strong>ПАО «ФАРМАК»</strong> – монтаж і налаштування складних
            систем вентиляції для чистих приміщень.
          </li>
          <li>
            <strong>Київська міська державна адміністрація</strong> –
            встановлення систем автоматизації та клімат-контролю.
          </li>
          <li>
            <strong>ГП «Укрспецекспорт»</strong> – монтаж систем вентиляції та
            охолодження для стратегічних об’єктів.
          </li>
          <li>
            <strong>Ресторан «Полісся»</strong> – інноваційні рішення для
            забезпечення комфорту відвідувачів.
          </li>
        </ul>
        <hr className='my-4' />
        <p>
          <strong>АРТ-КОМФОРТ</strong> – це не просто монтаж. Це гарантія того,
          що ваші системи працюватимуть як швейцарський годинник із першого дня.
          Готові побачити результат?
        </p>
      </div>
    );
  }, []);
  const renderMaintenance = useCallback(() => {
    return (
      <div className=''>
        <p className='mt-2'>
          Технічне обслуговування – це ключ до безперебійної роботи ваших
          інженерних систем. У компанії Арт-Комфорт ми забезпечуємо професійний
          сервіс, що відповідає найвищим стандартам, завдяки нашій команді та
          офіційним сертифікатам від провідних світових брендів.
        </p>
        <hr className='my-4' />
        <h4>Чому ми?</h4>
        <ol className='ml-4 mt-2 flex list-decimal flex-col gap-2'>
          <li>
            <p>Сертифікати від виробників</p>
            <p>
              Ми маємо сертифікати від усіх провідних брендів, з якими працюємо:
            </p>
            <ul className='ml-4 list-disc text-sm'>
              <li>
                <strong>
                  Daikin, Mitsubishi Electric, Systemair, Carel, Zanotti
                </strong>{' '}
                та інших.
              </li>
            </ul>
            <p>
              Ці сертифікати підтверджують, що ми маємо право здійснювати
              сервісне обслуговування їхнього обладнання, знаючи його до
              найменших деталей.
            </p>
          </li>
          <li>
            <p>Власні сервісні бригади</p>
            <p>
              Наша команда – це кілька бригад досвідчених інженерів, які
              працюють на об’єктах різного масштабу. Ми виконуємо:
            </p>
            <ul className='ml-4 list-disc text-sm'>
              <li>Планове технічне обслуговування.</li>
              <li>Швидкий ремонт.</li>
              <li> Пусконалагоджувальні роботи.</li>
            </ul>
            <p>
              Ми готові забезпечити нагляд за всіма системами вашого об’єкта,
              незалежно від їхньої складності.
            </p>
          </li>
          <li>
            <p>Комплексний підхід</p>
            <p>Ми обслуговуємо:</p>
            <ul className='ml-4 list-disc text-sm'>
              <li>
                <strong>ОВІК-системи</strong>: вентиляція, кондиціонери, теплові
                насоси.
              </li>
              <li>
                <strong>Системи автоматизації (BMS)</strong>: моніторинг,
                оновлення ПЗ, налаштування.
              </li>
              <li>
                <strong>Системи безпеки</strong>: відеоспостереження, контроль
                доступу, сигналізація.
              </li>
              <li>
                <strong>Водопостачання</strong>: перевірка насосів, очищення
                трубопроводів, діагностика.
              </li>
            </ul>
          </li>
          <li>
            <p>Гарантія якості</p>
            <p>
              Ми використовуємо тільки оригінальні запчастини, рекомендовані
              виробником, і суворо дотримуємося інструкцій щодо обслуговування.
            </p>
          </li>
        </ol>
        <hr className='my-4' />
        <h4>Як ми працюємо?</h4>
        <ol className='ml-4 flex list-decimal flex-col text-sm'>
          <li>
            <strong>Перевірка систем:</strong> Проводимо повну діагностику, щоб
            виявити потенційні проблеми та запобігти їхньому виникненню.
          </li>
          <li>
            <strong>Планове обслуговування</strong>: Регулярні перевірки та
            чистка обладнання для підтримки його ефективності.
          </li>
          <li>
            <strong>Ремонт</strong>: Оперативно реагуємо на будь-які
            несправності та швидко їх усуваємо.{' '}
          </li>
          <li>
            <strong>Контроль і підтримка</strong>: Ви можете бути впевнені, що
            ми наглядаємо за всіма системами, забезпечуючи стабільну роботу
            вашого об’єкта.
          </li>
        </ol>
        <hr className='my-4' />
        <h4>Наші референції</h4>
        <p>Ми вже успішно обслуговуємо:</p>
        <ul className='ml-4 mt-2 list-disc text-sm'>
          <li>
            <strong>ПАО «ФАРМАК»</strong> – регулярний сервіс складних
            фармацевтичних систем.
          </li>
          <li>
            <strong>Київська міська державна адміністрація</strong> – контроль і
            підтримка кліматичних систем.
          </li>
          <li>
            <strong>ПАО «Укртелеком»</strong> – технічне обслуговування
            масштабних інженерних мереж.
          </li>
          <li>
            <strong>Ресторан «Полісся»</strong> – повний супровід кліматичних і
            вентиляційних систем.
          </li>
        </ul>
        <hr className='my-4' />
        <h4>Сертифікати</h4>
        <p>
          Ми пишаємося тим, що маємо офіційні сертифікати від провідних
          виробників обладнання. Ці сертифікати підтверджують наш професіоналізм
          і право на виконання сервісних робіт.
        </p>
        <p>Сертифікати:</p>
        <ul className='ml-4 list-disc text-sm'>
          <li>
            <strong>Daikin</strong>: право на сервіс і технічну підтримку
            обладнання.
          </li>
          <li>
            <strong>Mitsubishi</strong> Electric: авторизація на обслуговування.
          </li>
          <li>
            <strong>Systemair</strong>: сертифікація для вентиляційних систем.
          </li>
          <li>
            <strong>Carel</strong>: технічний сервіс зволожувачів та
            автоматизації.
          </li>
          <li>
            <strong>Zanotti</strong>: обслуговування промислових систем
            охолодження.
          </li>
        </ul>

        <hr className='my-4' />
        <h4>Чому обирають нас?</h4>
        <ul className='ml-4 list-disc'>
          <li>
            Ми забезпечуємо стабільну роботу вашого обладнання на роки вперед.
          </li>
          <li>
            Наші сертифікати – це гарантія відповідності міжнародним стандартам.
          </li>
          <li>
            Ви отримуєте не просто обслуговування, а комплексний підхід до
            інженерної стабільності вашого об’єкта.
          </li>
        </ul>

        <h4 className='mt-4 font-bold'>
          Довірте свої системи тим, хто знає, як забезпечити їхню бездоганну
          роботу!
        </h4>
      </div>
    );
  }, []);
  const renderContent = useCallback(() => {
    if (!service) {
      return null;
    }
    switch (router?.query?.slug) {
      case 'design':
        return renderDesign();
      case 'supply':
        return renderSupply();
      case 'installation':
        return renderInstallation();
      case 'maintenance':
        return renderMaintenance();
      default:
        return null;
    }
  }, [
    renderDesign,
    renderSupply,
    renderInstallation,
    renderMaintenance,
    router?.query?.slug,
    service,
  ]);
  if (!service) {
    return null;
  }
  return (
    <Layout>
      <SectionWrapper>
        <motion.div
          className={cn(
            'mx-4 flex w-full max-w-7xl flex-col items-start pt-16'
          )}
        >
          <motion.div>
            <Button
              label={general.backToMain}
              size='small'
              onClick={router.back}
            />
          </motion.div>
          <h2 className='text-grayscale-header mt-8'>{service.subtitle}</h2>
          {renderContent()}
        </motion.div>
      </SectionWrapper>
    </Layout>
  );
};

export default ServicePage;
